#### LinePatternSegmentType Enumeration

---

|  |
| --- |
| See Also |

Represents the type of a line pattern segment.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum LinePatternSegmentType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LinePatternSegmentType ``` |

| Visual C++ |
| --- |
| ``` public enum class LinePatternSegmentType ``` |

# Members

| Member name | Description |
| --- | --- |
| Dash | A dash |
| Space | A space |
| Dot | A dot |
| Invalid |  |

# See Also

Autodesk.Revit.DB Namespace